Autodesk.Revit.DB.MEPSystemType.LinePatternId
Indicates the line pattern color that should override the line color for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012